{"url": "https://surfdudeguide.com", "name": "Surf Dude Guide", "color": "#43923f", "theme": "emerald", "description": "Welcome to Surf Dude Guide, your ultimate online resource for all things surfing and men's lifestyle. With our expert author, Mark Davis, we bring you a comprehensive guide that caters to the needs and interests of surfers and ocean enthusiasts like you.\r\n\r\nSurfing is not just a sport; it's a way of life. We understand the passion you have for riding the waves and immersing yourself in the surfing community. From legendary surfers like Kelly Slater and Eddie Aikau to rising stars like John John Florence and Kanoa Igarashi, we cover it all. Get the latest updates on surf news, rankings, and events, including \"The Eddie\" and the WSL competitions like the US Open of Surfing.\r\n\r\nLooking for the best surf shops near you? Our surf shop locator helps you find the nearest stores, including renowned spots like Ron Jon Surf Shop. Discover the latest surf gear, from stylish boardshorts and rash guards to long sports socks and surf-specific accessories. We believe that real men embrace the surf culture and express their unique style on and off the waves. Check out our articles on men's fashion and surf-inspired trends, including Jack Harlow's iconic white suit and Henry Cavill's fashionable pants.\r\n\r\nWhether you're a seasoned pro or just starting your surfing journey, our surf lessons and guides will help you improve your skills and enjoy the waves to the fullest. Learn about different surfboard types, including the popular Mini Malibu, and explore the art of catching big waves and mastering techniques like air surfing. Our experienced surfers, including Jamie O'Brien and Rob Machado, share their expertise to help you elevate your surf game.\r\n\r\nPlanning a surf trip? We've got you covered. Discover the best surf camps and resorts worldwide, such as the renowned Kandui Resort. Explore exotic surf destinations and learn about the unique experiences they offer. Our travel and surf guides provide insider tips and recommendations to make your surf adventures unforgettable.\r\n\r\nAt Surf Dude Guide, we celebrate the soul of surfing and the profound connection it brings to nature and the ocean. We delve into the art of bodysurfing, the thrill of big wave surfing, and the tranquility of para surfing. Immerse yourself in the surfing culture with our in-depth features on surf legends like Gerry Lopez and Greg Noll, who embody the spirit of the sport.\r\n\r\nStay up to date with the latest surfing news and trends, as we curate the most relevant stories and insights. Whether you're looking for surf reports, information on upcoming events, or the best spots to catch the perfect wave, our articles and resources are here to enhance your surfing experience.\r\n\r\nSurf Dude Guide is your go-to destination for everything related to the world of surfing. Join us as we ride the waves, explore the surf culture, and celebrate the essence of being a true surfer dude. Get ready to dive into the incredible world of surfing and discover your ultimate surf adventure.", "ga_property_id": "374350024", "ga_measurement_id": "G-BJDYL9CVJC"}